app/controllers/application_controller.rb

  def set_current_user
    return unless session[:user_id]

    Current.user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]