app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def index
    return unless session[:user_id]

    @user = User.find_by(id: session[:user_id])