app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-08-29 16:07:51.148522"], ["id", 1]]
---
  def update
    @user = User.find_signed!(params[:token], purpose: 'password_reset')
    if @user.update(password_params)